Zetesis-Labs/Sebastian/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# --- Network (LiveKit example_utils) ---
# Real WiFi credentials go in sdkconfig (gitignored), not here.
CONFIG_LK_EXAMPLE_USE_WIFI=y
CONFIG_LK_EXAMPLE_WIFI_SSID=""
CONFIG_LK_EXAMPLE_WIFI_PASSWORD=""

# --- LiveKit SDK required settings ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_WS_CLIENT_ENABLE_DYNAMIC_BUFFER=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# --- XIAO ESP32-S3 (ESP32-S3R8: 8 MB flash, 8 MB octal PSRAM) ---
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# --- USB microphone mode (NVS profile "micro-usb" / mode=usb_mic) ---
# Which mode boots is a PROVISIONING decision (profiles.c + boot selector),
# not a build flag: one binary carries both apps. These defaults shape the
# UAC device when that mode runs: "Sebastian Mic", 48 kHz mono 16-bit from
# the XVF comms beam. Speaker interface disabled (0 channels = compiled out).
# UAC_SUPPORT_MACOS only affects the speaker feedback-EP format — harmless
# here, kept on because this unit's host is a Mac.
CONFIG_UAC_SPEAKER_CHANNEL_NUM=0
CONFIG_UAC_MIC_CHANNEL_NUM=1
CONFIG_UAC_SAMPLE_RATE=48000
CONFIG_UAC_SUPPORT_MACOS=y
CONFIG_UAC_TUSB_MANUFACTURER="Zetesis"
CONFIG_UAC_TUSB_PRODUCT="Sebastian Mic"

# Handshake WS: el 101 de LiveKit llega coalescido con el primer frame
# (JoinResponse ~1KB) y el parser de transport_ws declara error si la
# lectura llena el buffer aunque el terminador esté dentro (bug IDF).
# 4KB deja margen holgado para el burst 101+frames.
CONFIG_WS_BUFFER_SIZE=4096

# --- Panic core dump to flash (partition "coredump" in partitions.csv) ---
# The console is unreadable in the field (UART0 = I2S pins, USB-JTAG owned by
# TinyUSB), so the crash summary is read back from flash and shipped over syslog.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_CHECK_BOOT=n


# --- Fleet: mDNS announce (announce.c) — task and allocations in PSRAM so the
# scarce internal SRAM (~37 KB free in session) is untouched.
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y
CONFIG_MDNS_MEMORY_ALLOC_SPIRAM=y
CONFIG_MDNS_MAX_SERVICES=4

# The whole agent loop runs on the main task (app_main → runAgent); the IDF
# default of 3584 B overflowed with one more frame (meeting sessions, block B).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
